# Converting

In [1]:
import pandas as pd

In [2]:
#importing our dataset
df = pd.read_excel('/home/pragya/fyp/abc_1.xlsx')
df.head()

   year  month  date       so2        no2        rspm         spm
0  2008      1     1  4.000000  36.500000  131.000000  388.000000
1  2008      1     2  4.948598  47.769626  249.912281  464.264151
2  2008      1     3  4.948598  47.769626  249.912281  464.264151
3  2008      1     4  4.000000  40.700000  164.000000  458.000000
4  2008      1     5  4.948598  47.769626  249.912281  464.264151

In [3]:
#merging columns year,month and date
df_date= df['year'].map(str) + '-' + df['month'].map(str) + '-' + df['date'].map(str)
df_date.head()

0    2008-1-1
1    2008-1-2
2    2008-1-3
3    2008-1-4
4    2008-1-5
dtype: object

In [4]:
#naming the column as date
date = pd.DataFrame(df_date,columns=['date'])
date.head()

       date
0  2008-1-1
1  2008-1-2
2  2008-1-3
3  2008-1-4
4  2008-1-5

In [5]:
#dropping columns year, month, date from our initial dataset
df_1 = pd.DataFrame()
df_1= df.drop(['year', 'month', 'date'], axis = 1)
df_1.head()

        so2        no2        rspm         spm
0  4.000000  36.500000  131.000000  388.000000
1  4.948598  47.769626  249.912281  464.264151
2  4.948598  47.769626  249.912281  464.264151
3  4.000000  40.700000  164.000000  458.000000
4  4.948598  47.769626  249.912281  464.264151

In [6]:
#merging both the dataframes
merged_df = pd.DataFrame()
merged_df = date.merge(df_1, right_index = True, left_index=True )
merged_df.head()

       date       so2        no2        rspm         spm
0  2008-1-1  4.000000  36.500000  131.000000  388.000000
1  2008-1-2  4.948598  47.769626  249.912281  464.264151
2  2008-1-3  4.948598  47.769626  249.912281  464.264151
3  2008-1-4  4.000000  40.700000  164.000000  458.000000
4  2008-1-5  4.948598  47.769626  249.912281  464.264151

In [8]:
#exporting it to new dataset
merged_df.to_excel(r'/home/pragya/fyp/date_data.xlsx')